; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p10---int100n150-m25---int100c200---s356---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 level121 level122 level123 level124 level125 level126 level127 level128 - fuellevel
)

(:init
(sum level0 level4 level4)
(sum level0 level5 level5)
(sum level0 level8 level8)
(sum level0 level13 level13)
(sum level0 level19 level19)
(sum level0 level20 level20)
(sum level0 level21 level21)
(sum level1 level4 level5)
(sum level1 level5 level6)
(sum level1 level8 level9)
(sum level1 level13 level14)
(sum level1 level19 level20)
(sum level1 level20 level21)
(sum level1 level21 level22)
(sum level2 level4 level6)
(sum level2 level5 level7)
(sum level2 level8 level10)
(sum level2 level13 level15)
(sum level2 level19 level21)
(sum level2 level20 level22)
(sum level2 level21 level23)
(sum level3 level4 level7)
(sum level3 level5 level8)
(sum level3 level8 level11)
(sum level3 level13 level16)
(sum level3 level19 level22)
(sum level3 level20 level23)
(sum level3 level21 level24)
(sum level4 level4 level8)
(sum level4 level5 level9)
(sum level4 level8 level12)
(sum level4 level13 level17)
(sum level4 level19 level23)
(sum level4 level20 level24)
(sum level4 level21 level25)
(sum level5 level4 level9)
(sum level5 level5 level10)
(sum level5 level8 level13)
(sum level5 level13 level18)
(sum level5 level19 level24)
(sum level5 level20 level25)
(sum level5 level21 level26)
(sum level6 level4 level10)
(sum level6 level5 level11)
(sum level6 level8 level14)
(sum level6 level13 level19)
(sum level6 level19 level25)
(sum level6 level20 level26)
(sum level6 level21 level27)
(sum level7 level4 level11)
(sum level7 level5 level12)
(sum level7 level8 level15)
(sum level7 level13 level20)
(sum level7 level19 level26)
(sum level7 level20 level27)
(sum level7 level21 level28)
(sum level8 level4 level12)
(sum level8 level5 level13)
(sum level8 level8 level16)
(sum level8 level13 level21)
(sum level8 level19 level27)
(sum level8 level20 level28)
(sum level8 level21 level29)
(sum level9 level4 level13)
(sum level9 level5 level14)
(sum level9 level8 level17)
(sum level9 level13 level22)
(sum level9 level19 level28)
(sum level9 level20 level29)
(sum level9 level21 level30)
(sum level10 level4 level14)
(sum level10 level5 level15)
(sum level10 level8 level18)
(sum level10 level13 level23)
(sum level10 level19 level29)
(sum level10 level20 level30)
(sum level10 level21 level31)
(sum level11 level4 level15)
(sum level11 level5 level16)
(sum level11 level8 level19)
(sum level11 level13 level24)
(sum level11 level19 level30)
(sum level11 level20 level31)
(sum level11 level21 level32)
(sum level12 level4 level16)
(sum level12 level5 level17)
(sum level12 level8 level20)
(sum level12 level13 level25)
(sum level12 level19 level31)
(sum level12 level20 level32)
(sum level12 level21 level33)
(sum level13 level4 level17)
(sum level13 level5 level18)
(sum level13 level8 level21)
(sum level13 level13 level26)
(sum level13 level19 level32)
(sum level13 level20 level33)
(sum level13 level21 level34)
(sum level14 level4 level18)
(sum level14 level5 level19)
(sum level14 level8 level22)
(sum level14 level13 level27)
(sum level14 level19 level33)
(sum level14 level20 level34)
(sum level14 level21 level35)
(sum level15 level4 level19)
(sum level15 level5 level20)
(sum level15 level8 level23)
(sum level15 level13 level28)
(sum level15 level19 level34)
(sum level15 level20 level35)
(sum level15 level21 level36)
(sum level16 level4 level20)
(sum level16 level5 level21)
(sum level16 level8 level24)
(sum level16 level13 level29)
(sum level16 level19 level35)
(sum level16 level20 level36)
(sum level16 level21 level37)
(sum level17 level4 level21)
(sum level17 level5 level22)
(sum level17 level8 level25)
(sum level17 level13 level30)
(sum level17 level19 level36)
(sum level17 level20 level37)
(sum level17 level21 level38)
(sum level18 level4 level22)
(sum level18 level5 level23)
(sum level18 level8 level26)
(sum level18 level13 level31)
(sum level18 level19 level37)
(sum level18 level20 level38)
(sum level18 level21 level39)
(sum level19 level4 level23)
(sum level19 level5 level24)
(sum level19 level8 level27)
(sum level19 level13 level32)
(sum level19 level19 level38)
(sum level19 level20 level39)
(sum level19 level21 level40)
(sum level20 level4 level24)
(sum level20 level5 level25)
(sum level20 level8 level28)
(sum level20 level13 level33)
(sum level20 level19 level39)
(sum level20 level20 level40)
(sum level20 level21 level41)
(sum level21 level4 level25)
(sum level21 level5 level26)
(sum level21 level8 level29)
(sum level21 level13 level34)
(sum level21 level19 level40)
(sum level21 level20 level41)
(sum level21 level21 level42)
(sum level22 level4 level26)
(sum level22 level5 level27)
(sum level22 level8 level30)
(sum level22 level13 level35)
(sum level22 level19 level41)
(sum level22 level20 level42)
(sum level22 level21 level43)
(sum level23 level4 level27)
(sum level23 level5 level28)
(sum level23 level8 level31)
(sum level23 level13 level36)
(sum level23 level19 level42)
(sum level23 level20 level43)
(sum level23 level21 level44)
(sum level24 level4 level28)
(sum level24 level5 level29)
(sum level24 level8 level32)
(sum level24 level13 level37)
(sum level24 level19 level43)
(sum level24 level20 level44)
(sum level24 level21 level45)
(sum level25 level4 level29)
(sum level25 level5 level30)
(sum level25 level8 level33)
(sum level25 level13 level38)
(sum level25 level19 level44)
(sum level25 level20 level45)
(sum level25 level21 level46)
(sum level26 level4 level30)
(sum level26 level5 level31)
(sum level26 level8 level34)
(sum level26 level13 level39)
(sum level26 level19 level45)
(sum level26 level20 level46)
(sum level26 level21 level47)
(sum level27 level4 level31)
(sum level27 level5 level32)
(sum level27 level8 level35)
(sum level27 level13 level40)
(sum level27 level19 level46)
(sum level27 level20 level47)
(sum level27 level21 level48)
(sum level28 level4 level32)
(sum level28 level5 level33)
(sum level28 level8 level36)
(sum level28 level13 level41)
(sum level28 level19 level47)
(sum level28 level20 level48)
(sum level28 level21 level49)
(sum level29 level4 level33)
(sum level29 level5 level34)
(sum level29 level8 level37)
(sum level29 level13 level42)
(sum level29 level19 level48)
(sum level29 level20 level49)
(sum level29 level21 level50)
(sum level30 level4 level34)
(sum level30 level5 level35)
(sum level30 level8 level38)
(sum level30 level13 level43)
(sum level30 level19 level49)
(sum level30 level20 level50)
(sum level30 level21 level51)
(sum level31 level4 level35)
(sum level31 level5 level36)
(sum level31 level8 level39)
(sum level31 level13 level44)
(sum level31 level19 level50)
(sum level31 level20 level51)
(sum level31 level21 level52)
(sum level32 level4 level36)
(sum level32 level5 level37)
(sum level32 level8 level40)
(sum level32 level13 level45)
(sum level32 level19 level51)
(sum level32 level20 level52)
(sum level32 level21 level53)
(sum level33 level4 level37)
(sum level33 level5 level38)
(sum level33 level8 level41)
(sum level33 level13 level46)
(sum level33 level19 level52)
(sum level33 level20 level53)
(sum level33 level21 level54)
(sum level34 level4 level38)
(sum level34 level5 level39)
(sum level34 level8 level42)
(sum level34 level13 level47)
(sum level34 level19 level53)
(sum level34 level20 level54)
(sum level34 level21 level55)
(sum level35 level4 level39)
(sum level35 level5 level40)
(sum level35 level8 level43)
(sum level35 level13 level48)
(sum level35 level19 level54)
(sum level35 level20 level55)
(sum level35 level21 level56)
(sum level36 level4 level40)
(sum level36 level5 level41)
(sum level36 level8 level44)
(sum level36 level13 level49)
(sum level36 level19 level55)
(sum level36 level20 level56)
(sum level36 level21 level57)
(sum level37 level4 level41)
(sum level37 level5 level42)
(sum level37 level8 level45)
(sum level37 level13 level50)
(sum level37 level19 level56)
(sum level37 level20 level57)
(sum level37 level21 level58)
(sum level38 level4 level42)
(sum level38 level5 level43)
(sum level38 level8 level46)
(sum level38 level13 level51)
(sum level38 level19 level57)
(sum level38 level20 level58)
(sum level38 level21 level59)
(sum level39 level4 level43)
(sum level39 level5 level44)
(sum level39 level8 level47)
(sum level39 level13 level52)
(sum level39 level19 level58)
(sum level39 level20 level59)
(sum level39 level21 level60)
(sum level40 level4 level44)
(sum level40 level5 level45)
(sum level40 level8 level48)
(sum level40 level13 level53)
(sum level40 level19 level59)
(sum level40 level20 level60)
(sum level40 level21 level61)
(sum level41 level4 level45)
(sum level41 level5 level46)
(sum level41 level8 level49)
(sum level41 level13 level54)
(sum level41 level19 level60)
(sum level41 level20 level61)
(sum level41 level21 level62)
(sum level42 level4 level46)
(sum level42 level5 level47)
(sum level42 level8 level50)
(sum level42 level13 level55)
(sum level42 level19 level61)
(sum level42 level20 level62)
(sum level42 level21 level63)
(sum level43 level4 level47)
(sum level43 level5 level48)
(sum level43 level8 level51)
(sum level43 level13 level56)
(sum level43 level19 level62)
(sum level43 level20 level63)
(sum level43 level21 level64)
(sum level44 level4 level48)
(sum level44 level5 level49)
(sum level44 level8 level52)
(sum level44 level13 level57)
(sum level44 level19 level63)
(sum level44 level20 level64)
(sum level44 level21 level65)
(sum level45 level4 level49)
(sum level45 level5 level50)
(sum level45 level8 level53)
(sum level45 level13 level58)
(sum level45 level19 level64)
(sum level45 level20 level65)
(sum level45 level21 level66)
(sum level46 level4 level50)
(sum level46 level5 level51)
(sum level46 level8 level54)
(sum level46 level13 level59)
(sum level46 level19 level65)
(sum level46 level20 level66)
(sum level46 level21 level67)
(sum level47 level4 level51)
(sum level47 level5 level52)
(sum level47 level8 level55)
(sum level47 level13 level60)
(sum level47 level19 level66)
(sum level47 level20 level67)
(sum level47 level21 level68)
(sum level48 level4 level52)
(sum level48 level5 level53)
(sum level48 level8 level56)
(sum level48 level13 level61)
(sum level48 level19 level67)
(sum level48 level20 level68)
(sum level48 level21 level69)
(sum level49 level4 level53)
(sum level49 level5 level54)
(sum level49 level8 level57)
(sum level49 level13 level62)
(sum level49 level19 level68)
(sum level49 level20 level69)
(sum level49 level21 level70)
(sum level50 level4 level54)
(sum level50 level5 level55)
(sum level50 level8 level58)
(sum level50 level13 level63)
(sum level50 level19 level69)
(sum level50 level20 level70)
(sum level50 level21 level71)
(sum level51 level4 level55)
(sum level51 level5 level56)
(sum level51 level8 level59)
(sum level51 level13 level64)
(sum level51 level19 level70)
(sum level51 level20 level71)
(sum level51 level21 level72)
(sum level52 level4 level56)
(sum level52 level5 level57)
(sum level52 level8 level60)
(sum level52 level13 level65)
(sum level52 level19 level71)
(sum level52 level20 level72)
(sum level52 level21 level73)
(sum level53 level4 level57)
(sum level53 level5 level58)
(sum level53 level8 level61)
(sum level53 level13 level66)
(sum level53 level19 level72)
(sum level53 level20 level73)
(sum level53 level21 level74)
(sum level54 level4 level58)
(sum level54 level5 level59)
(sum level54 level8 level62)
(sum level54 level13 level67)
(sum level54 level19 level73)
(sum level54 level20 level74)
(sum level54 level21 level75)
(sum level55 level4 level59)
(sum level55 level5 level60)
(sum level55 level8 level63)
(sum level55 level13 level68)
(sum level55 level19 level74)
(sum level55 level20 level75)
(sum level55 level21 level76)
(sum level56 level4 level60)
(sum level56 level5 level61)
(sum level56 level8 level64)
(sum level56 level13 level69)
(sum level56 level19 level75)
(sum level56 level20 level76)
(sum level56 level21 level77)
(sum level57 level4 level61)
(sum level57 level5 level62)
(sum level57 level8 level65)
(sum level57 level13 level70)
(sum level57 level19 level76)
(sum level57 level20 level77)
(sum level57 level21 level78)
(sum level58 level4 level62)
(sum level58 level5 level63)
(sum level58 level8 level66)
(sum level58 level13 level71)
(sum level58 level19 level77)
(sum level58 level20 level78)
(sum level58 level21 level79)
(sum level59 level4 level63)
(sum level59 level5 level64)
(sum level59 level8 level67)
(sum level59 level13 level72)
(sum level59 level19 level78)
(sum level59 level20 level79)
(sum level59 level21 level80)
(sum level60 level4 level64)
(sum level60 level5 level65)
(sum level60 level8 level68)
(sum level60 level13 level73)
(sum level60 level19 level79)
(sum level60 level20 level80)
(sum level60 level21 level81)
(sum level61 level4 level65)
(sum level61 level5 level66)
(sum level61 level8 level69)
(sum level61 level13 level74)
(sum level61 level19 level80)
(sum level61 level20 level81)
(sum level61 level21 level82)
(sum level62 level4 level66)
(sum level62 level5 level67)
(sum level62 level8 level70)
(sum level62 level13 level75)
(sum level62 level19 level81)
(sum level62 level20 level82)
(sum level62 level21 level83)
(sum level63 level4 level67)
(sum level63 level5 level68)
(sum level63 level8 level71)
(sum level63 level13 level76)
(sum level63 level19 level82)
(sum level63 level20 level83)
(sum level63 level21 level84)
(sum level64 level4 level68)
(sum level64 level5 level69)
(sum level64 level8 level72)
(sum level64 level13 level77)
(sum level64 level19 level83)
(sum level64 level20 level84)
(sum level64 level21 level85)
(sum level65 level4 level69)
(sum level65 level5 level70)
(sum level65 level8 level73)
(sum level65 level13 level78)
(sum level65 level19 level84)
(sum level65 level20 level85)
(sum level65 level21 level86)
(sum level66 level4 level70)
(sum level66 level5 level71)
(sum level66 level8 level74)
(sum level66 level13 level79)
(sum level66 level19 level85)
(sum level66 level20 level86)
(sum level66 level21 level87)
(sum level67 level4 level71)
(sum level67 level5 level72)
(sum level67 level8 level75)
(sum level67 level13 level80)
(sum level67 level19 level86)
(sum level67 level20 level87)
(sum level67 level21 level88)
(sum level68 level4 level72)
(sum level68 level5 level73)
(sum level68 level8 level76)
(sum level68 level13 level81)
(sum level68 level19 level87)
(sum level68 level20 level88)
(sum level68 level21 level89)
(sum level69 level4 level73)
(sum level69 level5 level74)
(sum level69 level8 level77)
(sum level69 level13 level82)
(sum level69 level19 level88)
(sum level69 level20 level89)
(sum level69 level21 level90)
(sum level70 level4 level74)
(sum level70 level5 level75)
(sum level70 level8 level78)
(sum level70 level13 level83)
(sum level70 level19 level89)
(sum level70 level20 level90)
(sum level70 level21 level91)
(sum level71 level4 level75)
(sum level71 level5 level76)
(sum level71 level8 level79)
(sum level71 level13 level84)
(sum level71 level19 level90)
(sum level71 level20 level91)
(sum level71 level21 level92)
(sum level72 level4 level76)
(sum level72 level5 level77)
(sum level72 level8 level80)
(sum level72 level13 level85)
(sum level72 level19 level91)
(sum level72 level20 level92)
(sum level72 level21 level93)
(sum level73 level4 level77)
(sum level73 level5 level78)
(sum level73 level8 level81)
(sum level73 level13 level86)
(sum level73 level19 level92)
(sum level73 level20 level93)
(sum level73 level21 level94)
(sum level74 level4 level78)
(sum level74 level5 level79)
(sum level74 level8 level82)
(sum level74 level13 level87)
(sum level74 level19 level93)
(sum level74 level20 level94)
(sum level74 level21 level95)
(sum level75 level4 level79)
(sum level75 level5 level80)
(sum level75 level8 level83)
(sum level75 level13 level88)
(sum level75 level19 level94)
(sum level75 level20 level95)
(sum level75 level21 level96)
(sum level76 level4 level80)
(sum level76 level5 level81)
(sum level76 level8 level84)
(sum level76 level13 level89)
(sum level76 level19 level95)
(sum level76 level20 level96)
(sum level76 level21 level97)
(sum level77 level4 level81)
(sum level77 level5 level82)
(sum level77 level8 level85)
(sum level77 level13 level90)
(sum level77 level19 level96)
(sum level77 level20 level97)
(sum level77 level21 level98)
(sum level78 level4 level82)
(sum level78 level5 level83)
(sum level78 level8 level86)
(sum level78 level13 level91)
(sum level78 level19 level97)
(sum level78 level20 level98)
(sum level78 level21 level99)
(sum level79 level4 level83)
(sum level79 level5 level84)
(sum level79 level8 level87)
(sum level79 level13 level92)
(sum level79 level19 level98)
(sum level79 level20 level99)
(sum level79 level21 level100)
(sum level80 level4 level84)
(sum level80 level5 level85)
(sum level80 level8 level88)
(sum level80 level13 level93)
(sum level80 level19 level99)
(sum level80 level20 level100)
(sum level80 level21 level101)
(sum level81 level4 level85)
(sum level81 level5 level86)
(sum level81 level8 level89)
(sum level81 level13 level94)
(sum level81 level19 level100)
(sum level81 level20 level101)
(sum level81 level21 level102)
(sum level82 level4 level86)
(sum level82 level5 level87)
(sum level82 level8 level90)
(sum level82 level13 level95)
(sum level82 level19 level101)
(sum level82 level20 level102)
(sum level82 level21 level103)
(sum level83 level4 level87)
(sum level83 level5 level88)
(sum level83 level8 level91)
(sum level83 level13 level96)
(sum level83 level19 level102)
(sum level83 level20 level103)
(sum level83 level21 level104)
(sum level84 level4 level88)
(sum level84 level5 level89)
(sum level84 level8 level92)
(sum level84 level13 level97)
(sum level84 level19 level103)
(sum level84 level20 level104)
(sum level84 level21 level105)
(sum level85 level4 level89)
(sum level85 level5 level90)
(sum level85 level8 level93)
(sum level85 level13 level98)
(sum level85 level19 level104)
(sum level85 level20 level105)
(sum level85 level21 level106)
(sum level86 level4 level90)
(sum level86 level5 level91)
(sum level86 level8 level94)
(sum level86 level13 level99)
(sum level86 level19 level105)
(sum level86 level20 level106)
(sum level86 level21 level107)
(sum level87 level4 level91)
(sum level87 level5 level92)
(sum level87 level8 level95)
(sum level87 level13 level100)
(sum level87 level19 level106)
(sum level87 level20 level107)
(sum level87 level21 level108)
(sum level88 level4 level92)
(sum level88 level5 level93)
(sum level88 level8 level96)
(sum level88 level13 level101)
(sum level88 level19 level107)
(sum level88 level20 level108)
(sum level88 level21 level109)
(sum level89 level4 level93)
(sum level89 level5 level94)
(sum level89 level8 level97)
(sum level89 level13 level102)
(sum level89 level19 level108)
(sum level89 level20 level109)
(sum level89 level21 level110)
(sum level90 level4 level94)
(sum level90 level5 level95)
(sum level90 level8 level98)
(sum level90 level13 level103)
(sum level90 level19 level109)
(sum level90 level20 level110)
(sum level90 level21 level111)
(sum level91 level4 level95)
(sum level91 level5 level96)
(sum level91 level8 level99)
(sum level91 level13 level104)
(sum level91 level19 level110)
(sum level91 level20 level111)
(sum level91 level21 level112)
(sum level92 level4 level96)
(sum level92 level5 level97)
(sum level92 level8 level100)
(sum level92 level13 level105)
(sum level92 level19 level111)
(sum level92 level20 level112)
(sum level92 level21 level113)
(sum level93 level4 level97)
(sum level93 level5 level98)
(sum level93 level8 level101)
(sum level93 level13 level106)
(sum level93 level19 level112)
(sum level93 level20 level113)
(sum level93 level21 level114)
(sum level94 level4 level98)
(sum level94 level5 level99)
(sum level94 level8 level102)
(sum level94 level13 level107)
(sum level94 level19 level113)
(sum level94 level20 level114)
(sum level94 level21 level115)
(sum level95 level4 level99)
(sum level95 level5 level100)
(sum level95 level8 level103)
(sum level95 level13 level108)
(sum level95 level19 level114)
(sum level95 level20 level115)
(sum level95 level21 level116)
(sum level96 level4 level100)
(sum level96 level5 level101)
(sum level96 level8 level104)
(sum level96 level13 level109)
(sum level96 level19 level115)
(sum level96 level20 level116)
(sum level96 level21 level117)
(sum level97 level4 level101)
(sum level97 level5 level102)
(sum level97 level8 level105)
(sum level97 level13 level110)
(sum level97 level19 level116)
(sum level97 level20 level117)
(sum level97 level21 level118)
(sum level98 level4 level102)
(sum level98 level5 level103)
(sum level98 level8 level106)
(sum level98 level13 level111)
(sum level98 level19 level117)
(sum level98 level20 level118)
(sum level98 level21 level119)
(sum level99 level4 level103)
(sum level99 level5 level104)
(sum level99 level8 level107)
(sum level99 level13 level112)
(sum level99 level19 level118)
(sum level99 level20 level119)
(sum level99 level21 level120)
(sum level100 level4 level104)
(sum level100 level5 level105)
(sum level100 level8 level108)
(sum level100 level13 level113)
(sum level100 level19 level119)
(sum level100 level20 level120)
(sum level100 level21 level121)
(sum level101 level4 level105)
(sum level101 level5 level106)
(sum level101 level8 level109)
(sum level101 level13 level114)
(sum level101 level19 level120)
(sum level101 level20 level121)
(sum level101 level21 level122)
(sum level102 level4 level106)
(sum level102 level5 level107)
(sum level102 level8 level110)
(sum level102 level13 level115)
(sum level102 level19 level121)
(sum level102 level20 level122)
(sum level102 level21 level123)
(sum level103 level4 level107)
(sum level103 level5 level108)
(sum level103 level8 level111)
(sum level103 level13 level116)
(sum level103 level19 level122)
(sum level103 level20 level123)
(sum level103 level21 level124)
(sum level104 level4 level108)
(sum level104 level5 level109)
(sum level104 level8 level112)
(sum level104 level13 level117)
(sum level104 level19 level123)
(sum level104 level20 level124)
(sum level104 level21 level125)
(sum level105 level4 level109)
(sum level105 level5 level110)
(sum level105 level8 level113)
(sum level105 level13 level118)
(sum level105 level19 level124)
(sum level105 level20 level125)
(sum level105 level21 level126)
(sum level106 level4 level110)
(sum level106 level5 level111)
(sum level106 level8 level114)
(sum level106 level13 level119)
(sum level106 level19 level125)
(sum level106 level20 level126)
(sum level106 level21 level127)
(sum level107 level4 level111)
(sum level107 level5 level112)
(sum level107 level8 level115)
(sum level107 level13 level120)
(sum level107 level19 level126)
(sum level107 level20 level127)
(sum level107 level21 level128)
(sum level108 level4 level112)
(sum level108 level5 level113)
(sum level108 level8 level116)
(sum level108 level13 level121)
(sum level108 level19 level127)
(sum level108 level20 level128)
(sum level109 level4 level113)
(sum level109 level5 level114)
(sum level109 level8 level117)
(sum level109 level13 level122)
(sum level109 level19 level128)
(sum level110 level4 level114)
(sum level110 level5 level115)
(sum level110 level8 level118)
(sum level110 level13 level123)
(sum level111 level4 level115)
(sum level111 level5 level116)
(sum level111 level8 level119)
(sum level111 level13 level124)
(sum level112 level4 level116)
(sum level112 level5 level117)
(sum level112 level8 level120)
(sum level112 level13 level125)
(sum level113 level4 level117)
(sum level113 level5 level118)
(sum level113 level8 level121)
(sum level113 level13 level126)
(sum level114 level4 level118)
(sum level114 level5 level119)
(sum level114 level8 level122)
(sum level114 level13 level127)
(sum level115 level4 level119)
(sum level115 level5 level120)
(sum level115 level8 level123)
(sum level115 level13 level128)
(sum level116 level4 level120)
(sum level116 level5 level121)
(sum level116 level8 level124)
(sum level117 level4 level121)
(sum level117 level5 level122)
(sum level117 level8 level125)
(sum level118 level4 level122)
(sum level118 level5 level123)
(sum level118 level8 level126)
(sum level119 level4 level123)
(sum level119 level5 level124)
(sum level119 level8 level127)
(sum level120 level4 level124)
(sum level120 level5 level125)
(sum level120 level8 level128)
(sum level121 level4 level125)
(sum level121 level5 level126)
(sum level122 level4 level126)
(sum level122 level5 level127)
(sum level123 level4 level127)
(sum level123 level5 level128)
(sum level124 level4 level128)

(connected l0 l1)
(fuelcost level8 l0 l1)
(connected l0 l2)
(fuelcost level4 l0 l2)
(connected l0 l3)
(fuelcost level20 l0 l3)
(connected l0 l4)
(fuelcost level5 l0 l4)
(connected l1 l0)
(fuelcost level8 l1 l0)
(connected l1 l3)
(fuelcost level21 l1 l3)
(connected l2 l0)
(fuelcost level4 l2 l0)
(connected l2 l3)
(fuelcost level13 l2 l3)
(connected l2 l4)
(fuelcost level19 l2 l4)
(connected l3 l0)
(fuelcost level20 l3 l0)
(connected l3 l1)
(fuelcost level21 l3 l1)
(connected l3 l2)
(fuelcost level13 l3 l2)
(connected l4 l0)
(fuelcost level5 l4 l0)
(connected l4 l2)
(fuelcost level19 l4 l2)

(at t0 l0)
(fuel t0 level128)
(= (total-cost) 0)

(at p0 l1)
(at p1 l0)
(at p2 l2)
(at p3 l1)
(at p4 l1)
(at p5 l4)
(at p6 l1)
(at p7 l4)
(at p8 l3)
(at p9 l4)
)

(:goal
(and
(at p0 l3)
(at p1 l4)
(at p2 l3)
(at p3 l4)
(at p4 l3)
(at p5 l2)
(at p6 l2)
(at p7 l0)
(at p8 l1)
(at p9 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 10
2. (drive t0 l0 l1 level120 level8 level128)
   deleted: (at t0 l0) (fuel t0 level128)
   added: (at t0 l1) (fuel t0 level120)
   goals met: 0 of 10
3. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 0 of 10
4. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 10
5. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 0 of 10
6. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 0 of 10
7. (drive t0 l1 l0 level112 level8 level120)
   deleted: (at t0 l1) (fuel t0 level120)
   added: (at t0 l0) (fuel t0 level112)
   goals met: 0 of 10
8. (drive t0 l0 l4 level107 level5 level112)
   deleted: (at t0 l0) (fuel t0 level112)
   added: (at t0 l4) (fuel t0 level107)
   goals met: 0 of 10
9. (unload p3 t0 l4)
   deleted: (in p3 t0)
   added: (at p3 l4)
   goals met: 1 of 10
10. (unload p1 t0 l4)
   deleted: (in p1 t0)
   added: (at p1 l4)
   goals met: 2 of 10
11. (load p9 t0 l4)
   deleted: (at p9 l4)
   added: (in p9 t0)
   goals met: 2 of 10
12. (load p7 t0 l4)
   deleted: (at p7 l4)
   added: (in p7 t0)
   goals met: 2 of 10
13. (load p5 t0 l4)
   deleted: (at p5 l4)
   added: (in p5 t0)
   goals met: 2 of 10
14. (drive t0 l4 l2 level88 level19 level107)
   deleted: (at t0 l4) (fuel t0 level107)
   added: (at t0 l2) (fuel t0 level88)
   goals met: 2 of 10
15. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 2 of 10
16. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 3 of 10
17. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 4 of 10
18. (drive t0 l2 l0 level84 level4 level88)
   deleted: (at t0 l2) (fuel t0 level88)
   added: (at t0 l0) (fuel t0 level84)
   goals met: 4 of 10
19. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 5 of 10
20. (drive t0 l0 l3 level64 level20 level84)
   deleted: (at t0 l0) (fuel t0 level84)
   added: (at t0 l3) (fuel t0 level64)
   goals met: 5 of 10
21. (load p8 t0 l3)
   deleted: (at p8 l3)
   added: (in p8 t0)
   goals met: 5 of 10
22. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 6 of 10
23. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 7 of 10
24. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 8 of 10
25. (unload p9 t0 l3)
   deleted: (in p9 t0)
   added: (at p9 l3)
   goals met: 9 of 10
26. (drive t0 l3 l1 level43 level21 level64)
   deleted: (at t0 l3) (fuel t0 level64)
   added: (at t0 l1) (fuel t0 level43)
   goals met: 9 of 10
27. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 10 of 10
